tutorials4NF/phaseChangeMaterial4NF/wavyChamberHybridHomogenous/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    right
    {

	type		fixedValue;
	value		uniform 343.0;
/*
	type		temperatureBC4NF;
	valueFunc	(340.0    0.0    0.0    0.0    0.0    0.0    0.0);
	dir		(0 1 0);
        T0		uniform 340.0;
*/
    }

    ".*"
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
