tutorials4NF/phaseChangeMaterial4NF/wavyChamberHybridHomogenous/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

#------------------------------- nanoFluid4Foam project -------------------------------#
#Author
    #Ehsan Golab, SUT. All rights reserved.
    #Ehsan1996Golab@gmail.com

#--------------------------------------------------------------------------------------#

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# cleancase is function that removes the files and directories.(rm -f : remove the file, rm -r : remove the directory).
cleancase ()
{
    rm -r Gnu*
    rm -r processor*
}

# (getApplication) is an command to find the solver name from the controlDict file. Also, ($) use for the variable.
application=$(getApplication)

cleancase

echo run wavyWall code ...
python wavyWall.py
mv points0_3.h constant/polyMesh
mv points4_7.h constant/polyMesh

echo run blockMesh ...
blockMesh

echo run solver ...
$application

# -------------------------------------------------------------------------- end-of-file






