tutorials4NF/phaseChangeMaterial4NF/wavyChamberHybridHomogenous/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

nx	100;
ny	100;

vertices
(
    //-back
    (0 0 -0.1)//0
    (1.0 0 -0.1)//1
    (1.0 1.0 -0.1)//2
    (0 1.0 -0.1)//3
    //-front
    (0 0 0.1)//4
    (1.0 0 0.1)//5
    (1.0 1.0 0.1)//6
    (0 1.0 0.1)//7
);

edges
(
    spline 0 3 (#include "points0_3.h")//back
    spline 4 7 (#include "points4_7.h")//front
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    right
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
